results/node/h3.txt
Bundle: 103.2 KB
Startup: 115.9 ms
Memory before: 82.1 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     41035.83    5721.84   45300.68
  Latency       12.18ms    41.99ms      3.24s
  HTTP codes:
    1xx - 0, 2xx - 409826, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     8.20MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     37613.43    2134.63   39534.68
  Latency       13.29ms    21.65ms      1.86s
  HTTP codes:
    1xx - 0, 2xx - 375693, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     8.98MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     29960.76    2210.43   32027.14
  Latency       16.69ms    47.64ms      2.01s
  HTTP codes:
    1xx - 0, 2xx - 299303, 3xx - 0, 4xx - 0, 5xx - 0
    others - 85
  Errors:
       timeout - 85
  Throughput:     9.35MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       121.32     178.52     605.72
  Latency       83.73ms     9.58ms   167.39ms
  HTTP codes:
    1xx - 0, 2xx - 1200, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.57GB/s

Memory after: 184.9 MB