results/node/hono.txt
Bundle: 61.4 KB
Startup: 120.4 ms
Memory before: 93.4 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     43961.45    5752.62   48021.80
  Latency       11.38ms    58.46ms      3.96s
  HTTP codes:
    1xx - 0, 2xx - 438895, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     9.49MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     33828.93    1874.08   35291.90
  Latency       14.78ms    28.87ms      2.43s
  HTTP codes:
    1xx - 0, 2xx - 337958, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     8.63MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     25495.38    2173.41   27975.29
  Latency       19.61ms    62.68ms      2.01s
  HTTP codes:
    1xx - 0, 2xx - 254584, 3xx - 0, 4xx - 0, 5xx - 0
    others - 165
  Errors:
       timeout - 165
  Throughput:     7.66MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec        96.62     168.34     587.82
  Latency      102.85ms    14.67ms   221.09ms
  HTTP codes:
    1xx - 0, 2xx - 975, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.28GB/s

Memory after: 181.6 MB