results/node/hyper-express.txt
Bundle: 247.7 KB
Startup: 105.0 ms
Memory before: 74.7 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     78026.97    6382.91   83290.76
  Latency        6.42ms     1.41ms    87.19ms
  HTTP codes:
    1xx - 0, 2xx - 776530, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    12.21MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     63083.73    5292.47   66571.92
  Latency        7.92ms   797.74us    36.37ms
  HTTP codes:
    1xx - 0, 2xx - 629865, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    12.36MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     47747.03    4741.81   50861.18
  Latency       10.47ms     1.26ms    53.30ms
  HTTP codes:
    1xx - 0, 2xx - 476659, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    12.90MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       147.89     111.18     511.22
  Latency       67.34ms     6.06ms   126.85ms
  HTTP codes:
    1xx - 0, 2xx - 1490, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.96GB/s

Memory after: 203.3 MB