results/node/koa.txt
Bundle: 728.7 KB
Startup: 111.6 ms
Memory before: 80.8 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     15970.19    1718.73   17263.14
  Latency       31.31ms   375.61ms     10.09s
  HTTP codes:
    1xx - 0, 2xx - 160018, 3xx - 0, 4xx - 0, 5xx - 0
    others - 28
  Errors:
       timeout - 28
  Throughput:     3.43MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     15096.35     673.66   15845.88
  Latency       33.08ms   306.73ms     10.01s
  HTTP codes:
    1xx - 0, 2xx - 151007, 3xx - 0, 4xx - 0, 5xx - 0
    others - 130
  Errors:
       timeout - 130
  Throughput:     3.85MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     12004.09    1095.34   20034.17
  Latency       41.65ms   244.09ms      5.06s
  HTTP codes:
    1xx - 0, 2xx - 119367, 3xx - 0, 4xx - 0, 5xx - 0
    others - 1052
  Errors:
       timeout - 1052
  Throughput:     3.72MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       109.49     129.45     532.56
  Latency       90.77ms    10.07ms   171.86ms
  HTTP codes:
    1xx - 0, 2xx - 1110, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.45GB/s

Memory after: 163.4 MB