results/node/nest.txt
Bundle: 1.3 MB
Startup: 270.6 ms
Memory before: 102.1 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     11693.36    1402.87   12955.69
  Latency       42.80ms   399.37ms     10.72s
  HTTP codes:
    1xx - 0, 2xx - 117221, 3xx - 0, 4xx - 0, 5xx - 0
    others - 19
  Errors:
       timeout - 19
  Throughput:     3.03MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     10926.28     499.42   12506.82
  Latency       45.67ms   261.02ms     10.01s
  HTTP codes:
    1xx - 0, 2xx - 109468, 3xx - 0, 4xx - 0, 5xx - 0
    others - 75
  Errors:
       timeout - 75
  Throughput:     3.22MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      8095.20    2009.58   23371.85
  Latency       62.40ms   383.48ms      8.07s
  HTTP codes:
    1xx - 0, 2xx - 79796, 3xx - 0, 4xx - 0, 5xx - 0
    others - 942
  Errors:
       timeout - 942
  Throughput:     2.82MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       110.50     168.31     588.92
  Latency       90.72ms    13.12ms   191.19ms
  HTTP codes:
    1xx - 0, 2xx - 1110, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.45GB/s

Memory after: 194.4 MB