results/node/ultimate-express.txt
Bundle: 582.1 KB
Startup: 152.7 ms
Memory before: 95.7 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    123665.57   14937.95  149689.94
  Latency        4.04ms     0.91ms    46.09ms
  HTTP codes:
    1xx - 0, 2xx - 1234398, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    27.07MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     37710.13    5518.83   41369.58
  Latency       13.28ms     2.61ms   102.16ms
  HTTP codes:
    1xx - 0, 2xx - 375651, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     9.63MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     40264.98    3756.51   43824.27
  Latency       12.43ms     1.22ms    71.64ms
  HTTP codes:
    1xx - 0, 2xx - 401629, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    13.89MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       139.16      95.83     414.91
  Latency       71.76ms     6.22ms   123.67ms
  HTTP codes:
    1xx - 0, 2xx - 1397, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.83GB/s

Memory after: 236.2 MB